/*
  cafeKit - Decrypt Wii U NUS content to save space on compression, then 
  reencrypt the content with 1:1 output from the original nus package

  Copyright © 2013-2015 crediar <https://code.google.com/p/cdecrypt/>
  Copyright © 2020-2021 VitaSmith <https://github.com/VitaSmith/cdecrypt>
  Copyright © 2022-2023 leonardo the human <https://github.com/leonardothehuman/cafeKit>

  This program is free software: you can redistribute it and/or modify
  it under the terms of the GNU General Public License as published by
  the Free Software Foundation, either version 3 of the License, or
  (at your option) any later version.

  This program is distributed in the hope that it will be useful,
  but WITHOUT ANY WARRANTY; without even the implied warranty of
  MERCHANTABILITY or FITNESS FOR A PARTICULAR PURPOSE.  See the
  GNU General Public License for more details.

  You should have received a copy of the GNU General Public License
  along with this program.  If not, see <http://www.gnu.org/licenses/>.
*/

#include <assert.h>
#include <inttypes.h>
#include <stdint.h>
#include <stdio.h>
#include <stdlib.h>
#include <string.h>
#include <dirent.h>

#include "utf8.h"
#include "util.h"
#include "aes.h"
#include "sha1.h"
#include "linkedListNusBlobs.h"
#include "cafeKit_private.h"

#define MAX_ENTRIES     90000
#define MAX_LEVELS      16
#define FST_MAGIC       0x46535400              // 'FST\0'
// We use part of the root cert name used by TMD/TIK to identify them
#define TMD_MAGIC       0x4350303030303030ULL   // 'CP000000'
#define TIK_MAGIC       0x5853303030303030ULL   // 'XS000000'
#define T_MAGIC_OFFSET  0x0150
#define HASH_BLOCK_SIZE 0xFC00
#define HASHES_SIZE     0x0400

static const uint8_t WiiUCommonDevKey[16] =
    { 0x2F, 0x5C, 0x1B, 0x29, 0x44, 0xE7, 0xFD, 0x6F, 0xC3, 0x97, 0x96, 0x4B, 0x05, 0x76, 0x91, 0xFA };
static const uint8_t WiiUCommonKey[16] =
    { 0xD7, 0xB0, 0x04, 0x02, 0x65, 0x9B, 0xA2, 0xAB, 0xD2, 0xCB, 0x0D, 0xB2, 0x7F, 0xA2, 0xB6, 0x56 };

aes_context     ctx;
aes_context     ectx;
uint8_t         title_id[16];
uint8_t         title_key[16];
uint64_t        h0_count = 0;
uint64_t        h0_fail  = 0;

#pragma pack(1)

char destination_directory[PATH_MAX];
const char* pattern_path[] = { "%s%c%08x.app", "%s%c%08X.app", "%s%c%08x", "%s%c%08X" };
const char* pattern_h3[] = { "%s%c%08x.h3", "%s%c%08X.h3" };
char * input_directory;

enum ApplicationMode{
    ENCRYPT = 0x00,
    DECRYPT = 0x01
};
enum ApplicationMode application_mode;

enum ContentType
{
    CONTENT_REQUIRED = (1 << 0),    // Not sure
    CONTENT_SHARED   = (1 << 15),
    CONTENT_OPTIONAL = (1 << 14),
};

typedef struct
{
    uint16_t IndexOffset;           //  0  0x204
    uint16_t CommandCount;          //  2  0x206
    uint8_t  SHA2[32];              //  12 0x208
} ContentInfo;

typedef struct
{
    uint32_t ID;                    //  0  0xB04
    uint16_t Index;                 //  4  0xB08
    uint16_t Type;                  //  6  0xB0A
    uint64_t Size;                  //  8  0xB0C
    uint8_t  SHA2[32];              //  16 0xB14
} Content;

typedef struct
{
    uint32_t SignatureType;         // 0x000
    uint8_t  Signature[0x100];      // 0x004

    uint8_t  Padding0[0x3C];        // 0x104
    uint8_t  Issuer[0x40];          // 0x140

    uint8_t  Version;               // 0x180
    uint8_t  CACRLVersion;          // 0x181
    uint8_t  SignerCRLVersion;      // 0x182
    uint8_t  Padding1;              // 0x183

    uint64_t SystemVersion;         // 0x184
    uint64_t TitleID;               // 0x18C
    uint32_t TitleType;             // 0x194
    uint16_t GroupID;               // 0x198
    uint8_t  Reserved[62];          // 0x19A
    uint32_t AccessRights;          // 0x1D8
    uint16_t TitleVersion;          // 0x1DC
    uint16_t ContentCount;          // 0x1DE
    uint16_t BootIndex;             // 0x1E0
    uint8_t  Padding3[2];           // 0x1E2
    uint8_t  SHA2[32];              // 0x1E4

    ContentInfo ContentInfos[64];

    Content  Contents[];            // 0x1E4

} TitleMetaData;

struct FSTInfo
{
    uint32_t Unknown;
    uint32_t Size;
    uint32_t UnknownB;
    uint32_t UnknownC[6];
};

struct FST
{
    uint32_t MagicBytes;
    uint32_t Unknown;
    uint32_t EntryCount;

    uint32_t UnknownB[5];

    struct FSTInfo FSTInfos[];
};

struct FEntry
{
    union
    {
        struct
        {
            uint32_t Type : 8;
            uint32_t NameOffset : 24;
        };
        uint32_t TypeName;
    };
    union
    {
        struct      // File Entry
        {
            uint32_t FileOffset;
            uint32_t FileLength;
        };
        struct       // Dir Entry
        {
            uint32_t ParentOffset;
            uint32_t NextOffset;
        };
        uint32_t entry[2];
    };
    uint16_t Flags;
    uint16_t ContentID;
};

int dir_empty(const char *path){ //checks if the directory is empty
	struct dirent *ent;
	int ret = 1;

